app/controllers/admin/admin_users_controller.rb

  def index
    @user_index = User.all
---
SELECT "users".* FROM "users"