app/controllers/admin/admin_events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @event_index = Event.all