app/views/users/show.html.erb

SELECT "events".* FROM "events"
---
      <!-- ... -->
<% Event.all.each do |event| %>