app/views/events/index.html.erb

  <div id="index">
  <% Event.all.each do |event| %>
---
SELECT "events".* FROM "events"