app/views/events/show.html.erb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

<% finder = Event.find(params[:id]) %>