app/controllers/events_controller.rb

  def index
    @event = Event.all
---
SELECT "events".* FROM "events"

  def create
    @event_newnew = Event.new(start_date: params["start_date"], duration: params["duration"], title: params["title"], description: params["description"], price: params["price"], location: params["location"], admin_id: current_user.id)

    if @event_newnew.save # essaie de sauvegarder en base @gossip
---
INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @event_edit = Event.find(params[:id])
    if @event_edit.update(start_date: params["start_date"], duration: params["duration"], title: params["title"], description: params["description"], price: params["price"], location: params["location"], admin_id: current_user.id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "events" SET "start_date" = $1, "duration" = $2, "title" = $3, "price" = $4, "location" = $5, "updated_at" = $6 WHERE "events"."id" = $7  [["start_date", "2021-02-28 15:47:00"], ["duration", 100], ["title", "RETESTAGAIN"], ["price", 1000], ["location", "Paris"], ["updated_at", "2021-02-18 09:47:58.907667"], ["id", 6]]

  def destroy
    @event_destroy = Event.find(params[:id])
    @event_destroy.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 6]]