app/controllers/participations_controller.rb

  def new
    @stripe_amount = Event.find(params[:event_id]).price * 100
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @stripe_amount = Event.find(params[:event_id]).price * 100

  customer = Stripe::Customer.create({
  email: params[:stripeEmail],
  source: params[:stripeToken],
  })

  charge = Stripe::Charge.create({
  customer: customer.id,
  amount: @stripe_amount,
  description: "Stripe customer",
  currency: 'usd',
  })

  @new_participation = Participation.new
  @new_participation.user_id = current_user.id
  @new_participation.event_id = Event.find(params['event_id']).id
  @new_participation.stripe_customer_id = charge.customer

  if @new_participation.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "participations" ("stripe_customer_id", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stripe_customer_id", "cus_IxrsSHSiI6DTXp"], ["user_id", 6], ["event_id", 2], ["created_at", "2021-02-17 19:56:50.180246"], ["updated_at", "2021-02-17 19:56:50.180246"]]